<!DOCTYPE html>
<html>

  <head>
  <meta charset="utf-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  <title>C++虚函数表分析 « NotBeCN</title>
  <meta name="description" content="             &nbsp;&nbsp; &nbsp;在&lt;&lt;反C++&gt;&gt;文中提到的 VC6.0 上的编译器支持一个d1reportAllClassLayout的开关, 能够输出全部对象的内存布局信息,&nbsp;我自己经常使用vs2005来开发，所以这里我就以vs2005为例讲怎...">

  <link rel="stylesheet" href="/css/main.css">
  <link rel="canonical" href="https://notbe.cn/2017/11/14/weixin_34209851_90136145.html">
  <link rel="alternate" type="application/rss+xml" title="NotBeCN" href="https://notbe.cn/feed.xml" />
</head>


  <body>

    <div class="header-placeholder"></div>
<header class="header">
  <div class="wrapper">
    <div id="sidebar-toggle">TOC</div>
    <a class="site-title" href="/">NotBeCN</a>
    <nav class="site-nav">
      
        
        <a class="page-link" href="/about/" target="_blank">关于</a>
      
        
        <a class="page-link" href="https://uzshare.com" target="_blank">社区</a>
      
        
        <a class="page-link" href="/donate/" target="_blank">Donate</a>
      
        
        <a class="page-link" href="/games/shejiyazi/" target="_blank">射个鸭子</a>
      
    </nav>
  </div>
</header>


    <div class="page-content">
      <div class="wrapper">
        <div class="col-main">
          <div class="post">

  <header class="post-header">
    <h1 class="post-title">C++虚函数表分析</h1>
    <p class="post-meta">Nov 14, 2017</p>
  </header>

  <article class="post-content">
    <div id="article_content" class="article_content clearfix csdn-tracking-statistics" data-pid="blog" data-mod="popu_307" data-dsm="post"> 
 <link rel="stylesheet" href="https://csdnimg.cn/release/phoenix/template/css/ck_htmledit_views-f57960eb32.css"> 
 <link rel="stylesheet" href="https://csdnimg.cn/release/phoenix/template/css/ck_htmledit_views-f57960eb32.css"> 
 <div class="htmledit_views" id="content_views"> 
  <div class="content-detail markdown-body"> 
   <p align="left" style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;"><span style="line-height:1.8;">&nbsp;&nbsp; &nbsp;在&lt;&lt;</span>反C++&gt;&gt;文中提到的 VC6.0 上的编译器支持一个d1reportAllClassLayout的开关, 能够输出全部对象的内存布局信息,&nbsp;我自己经常使用vs2005来开发，所以这里我就以vs2005为例讲怎么设置d1reportAllClassLayout。</p> 
   <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;"><span style="line-height:1.8;">&nbsp; &nbsp; &nbsp; &nbsp; 右键项目属性(Properties)—</span>》配制属性(Configuration Properties)—》C/C++--》命令行（Command Line）的框里输入/d1reportAllClassLayout，就可以看类的对象布局。例如以下图：（当然也能够使用命令行：cl –d1reportSingleClassLayout[classname] test.cpp）</p> 
   <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;text-align:center;"><img src="https://uzshare.com/_p?https://img-blog.csdn.net/20141013134957823?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQvd2VucmVuaHVhMDg=/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/SouthEast" alt="" style="border:0px;"><br></p> 
   <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;"></p> 
   <p align="left" style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;"><span style="line-height:1.8;">測试代码：</span></p> 
   <pre><code class="language-cpp">class CBase
{
public:
        virtual void fun(void) {}

private:
        int m_valuable;
};
</code></pre> 
   <span style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;">输出结果：</span> 
   <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;"></p> 
   <pre><code class="language-cpp">class CBase size(8):
 +---
 0 | {vfptr}
 4 | m_valuable
 +---
CBase::$vftable@:
 | &amp;CBase_meta
 |  0
 0 | &amp;CBase::fun
CBase::fun this adjustor: 0
</code></pre> 
   <pre><code class="language-cpp">CDerived：非virtual继承CBase，持有一个virtual重写方法和一个virtual新方法。一个成员变量
class CDerived: public CBase
{
public:
	void fun(void) { }
	virtual void vfun(void) { }

public:
	int m_derived;
};
编译后输出结果：
class CDerived size(12):
 +---
 | +--- (base class CBase)
 0 | | {vfptr}
 4 | | m_valuable
 | +---
 8 | m_derived
 +---
CDerived::$vftable@:
 | &amp;CDerived_meta
 |  0
 0 | &amp;CDerived::fun
 1 | &amp;CDerived::vfun
CDerived::fun this adjustor: 0
CDerived::vfun this adjustor: 0
当中vftable@CBase的CBase::fun项在这里更新为CDerived::fun，同一时候添加了一项CDerived::vfun。
CDerived2：virtual继承CBase，持有一个virtual重写方法和一个virtual新方法，一个成员变量。因此结构为vftable@自身，vbtable@自身，member@自身，以及CBase结构。
总结：
class CDerived2: virtual public CBase
{
public:
	void fun(void) { }
	virtual void vfun(void) { }

public:
	int m_derived;
};
结果输出：
class CDerived2 size(20):
 +---
 0 | {vfptr}
 4 | {vbptr}
 8 | m_derived
 +---
 +--- (virtual base CBase)
12 | {vfptr}
16 | m_valuable
 +---
CDerived2::$vftable@CDerived2@:
 | &amp;CDerived2_meta
 |  0
 0 | &amp;CDerived2::vfun
CDerived2::$vbtable@:
 0 | -4
 1 | 8 (CDerived2d(CDerived2+4)CBase)
CDerived2::$vftable@CBase@:
 | -12
 0 | &amp;CDerived2::fun
CDerived2::fun this adjustor: 12
CDerived2::vfun this adjustor: 0
vbi:    class  offset o.vbptr  o.vbte fVtorDisp
           CBase      12       4       4 0
当中vftable@自身仅仅有一项：CDerived2::vfun()，vbtable@自身仅仅有一项：它virtual继承的父类CBase。而vftable@CBase原来的CBase::fun更新为CDerived2::fun。

CDerived3：virtual继承CBase，因此结构为vbtable@自身，member@自身。CBase结构
class CDerived3: virtual public CBase
{
public:
	void fun(void) { }

public:
	int m_derived3;
};
结果输出：
class CDerived3 size(16):
 +---
 0 | {vbptr}
 4 | m_derived3
 +---
 +--- (virtual base CBase)
 8 | {vfptr}
12 | m_valuable
 +---
CDerived3::$vbtable@:
 0 | 0
 1 | 8 (CDerived3d(CDerived3+0)CBase)
CDerived3::$vftable@:
 | -8
 0 | &amp;CDerived3::fun
CDerived3::fun this adjustor: 8
vbi:    class  offset o.vbptr  o.vbte fVtorDisp
           CBase       8       0       4 0
CGDerived：继承CDerived2、CDerived3
class CGDerived: public CDerived2, public CDerived3
{
public:
	void vfun() { }
	virtual void vgfun() { }

public:
	int m_gd;
};
输出：
class CGDerived size(32):
 +---
 | +--- (base class CDerived2)
 0 | | {vfptr}
 4 | | {vbptr}
 8 | | m_derived
 | +---
 | +--- (base class CDerived3)
12 | | {vbptr}
16 | | m_derived3
 | +---
20 | m_gd
 +---
 +--- (virtual base CBase)
24 | {vfptr}
28 | m_valuable
 +---
CGDerived::$vftable@CDerived2@:
 | &amp;CGDerived_meta
 |  0
 0 | &amp;CGDerived::vfun
 1 | &amp;CGDerived::vgfun
CGDerived::$vbtable@CDerived2@:
 0 | -4
 1 | 20 (CGDerivedd(CDerived2+4)CBase)
CGDerived::$vbtable@CDerived3@:
 0 | 0
 1 | 12 (CGDerivedd(CDerived3+0)CBase)
CGDerived::$vftable@CBase@:
 | -24
 0 | &amp;thunk: this-=12; goto CDerived2::fun
CGDerived::vfun this adjustor: 0
CGDerived::vgfun this adjustor: 0
vbi:    class  offset o.vbptr  o.vbte fVtorDisp
           CBase      24       4       4 0
因此首先是CDerived2的结构和CDerived3的结构，自己的新virtual方法vgfun则加入在最左父类CDerived2的虚函数表中。然后是自己的成员。
</code></pre> 
   <p></p> 
   <p>最后。CDerived2和CDerived3的父类CBase结构也带入当中。</p> 
   <p>它的fun默认指向CGDerived的最左父类CDerived2::fun。</p> 
   <p> CGG：继承CGDerived class CGG: public CGDerived { public: int m_kc; }; 输出： class CGG size(36): +--- | +--- (base class CGDerived) | | +--- (base class CDerived2) 0 | | | {vfptr} 4 | | | {vbptr} 8 | | | m_derived | | +--- | | +--- (base class CDerived3) 12 | | | {vbptr} 16 | | | m_derived3 | | +--- 20 | | m_gd | +--- 24 | m_kc +--- +--- (virtual base CBase) 28 | {vfptr} 32 | m_valuable +--- CGG::$vftable@CDerived2@: | &amp;CGG_meta | 0 0 | &amp;CGDerived::vfun 1 | &amp;CGDerived::vgfun CGG::$vbtable@CDerived2@: 0 | -4 1 | 24 (CGGd(CDerived2+4)CBase) CGG::$vbtable@CDerived3@: 0 | 0 1 | 16 (CGGd(CDerived3+0)CBase) CGG::$vftable@CBase@: | -28 0 | &amp;thunk: this-=16; goto CDerived2::fun vbi: class offset o.vbptr o.vbte fVtorDisp CBase 28 4 4 0 添加一个变量，基本仅仅是把CGDerived的结构再套一层。最后加上自己的成员变量。</p> 
   <p>vbtable所指向的父类结构依旧在最后。 空类 class CBase2 { }; 输出： class CBase2 size(1): +--- +--- CD2：virtual继承则一定会创建vbtable，用vbptr指针指向，因此size为4 class CD2: virtual public CBase2 { }; 输出： class CD2 size(4): +--- 0 | {vbptr} +--- +--- (virtual base CBase2) +--- CD2::$vbtable@: 0 | 0 1 | 4 (CD2d(CD2+0)CBase2) vbi: class offset o.vbptr o.vbte fVtorDisp CBase2 4 0 4 0 CE：非virtual继承CD2和CDerived2。于是依照类的声明顺序，先带入CDerived2的结构，再带入CD2的结构（而不是按继承顺序） class CE: public CD2, public CDerived2 { }; 输出： class CE size(24): +--- | +--- (base class CDerived2) 0 | | {vfptr} 4 | | {vbptr} 8 | | m_derived | +--- | +--- (base class CD2) 12 | | {vbptr} | +--- +--- +--- (virtual base CBase2) +--- +--- (virtual base CBase) 16 | {vfptr} 20 | m_valuable +--- CE::$vftable@CDerived2@: | &amp;CE_meta | 0 0 | &amp;CDerived2::vfun CE::$vbtable@CD2@: 0 | 0 1 | 4 (CEd(CD2+0)CBase2) 2 | 4 (CEd(CE+12)CBase) CE::$vbtable@CDerived2@: 0 | -4 1 | 12 (CEd(CDerived2+4)CBase) CE::$vftable@CBase@: | -16 0 | &amp;thunk: this-=4; goto CDerived2::fun vbi: class offset o.vbptr o.vbte fVtorDisp CBase2 16 12 4 0 CBase 16 12 8 0 CF：virtual继承CBase和CBase2，vbtable此时的项便有两个。此时依照继承的顺序，而不是依照类的声明顺序 class CF: virtual public CBase2, virtual public CBase { }; 输出： class CF size(12): +--- 0 | {vbptr} +--- +--- (virtual base CBase2) +--- +--- (virtual base CBase) 4 | {vfptr} 8 | m_valuable +--- CF::$vbtable@: 0 | 0 1 | 4 (CFd(CF+0)CBase2) 2 | 4 (CFd(CF+0)CBase) CF::$vftable@: | -4 0 | &amp;CBase::fun vbi: class offset o.vbptr o.vbte fVtorDisp CBase2 4 0 4 0 CBase 4 0 8 0 </p> 
   <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;"></p> 
   <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;background:#FFFFFF;"><strong><span style="line-height:1.8;color:rgb(68,68,68);">总结：</span></strong></p> 
   <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;background:#FFFFFF;"><span style="line-height:1.8;color:rgb(68,68,68);">&nbsp;继承方式：非virtual</span><span style="line-height:1.8;">继承：导入各个父类的结构（依照父类声明的顺序，从上到下），自身member在最后</span></p> 
   <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;background:#FFFFFF;"><span style="line-height:1.8;color:rgb(68,68,68);">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</span><span style="line-height:1.8;color:rgb(68,68,68);">重写virtual</span>方法：更新该方法最早定义的类的vftable</p> 
   <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;background:#FFFFFF;"><span style="line-height:1.8;color:rgb(68,68,68);">&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</span><span style="line-height:1.8;color:rgb(68,68,68);">新的virtual</span>方法：在最左父类的vftable添加</p> 
   <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;background:#FFFFFF;"><span style="line-height:1.8;color:rgb(68,68,68);">&nbsp;</span><span style="line-height:1.8;color:rgb(68,68,68);">继承方式：有virtual</span>继承：在自身member后添加virtual父类的结构（依照子类继承的顺序从左到右）。同一时候在最前面添加vbtable（假设没有的话），添加一项指向父类结构</p> 
   <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;background:#FFFFFF;"><span style="line-height:1.8;color:rgb(68,68,68);">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;重写virtual</span>方法：更新该方法的最早定义的类的vftable</p> 
   <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;background:#FFFFFF;"><span style="line-height:1.8;color:rgb(68,68,68);">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;新的virtual</span>方法：在自身最前面添加vftable（假设没有的话），在自己的vftable添加</p> 
   <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;background:#FFFFFF;"><br></p> 
   <strong style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;">附 全部源代码：</strong>
   <span style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;"></span> 
   <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;"></p> 
   <pre><code class="language-cpp">#ifndef TEST_CBASE_H
#define TEST_CBASE_H

class CBase
{
public:
	CBase();
	explicit CBase(int valuabel);
	~CBase();

	virtual void fun(void) {}

private:
	int m_valuable;
};

class CDerived: public CBase
{
public:
	void fun(void) { }
	virtual void vfun(void) { }

public:
	int m_derived;
};

class CDerived2: virtual public CBase
{
public:
	void fun(void) { }
	virtual void vfun(void) { }

public:
	int m_derived;
};

class CDerived3: virtual public CBase
{
public:
	void fun(void) { }

public:
	int m_derived3;
};

class CGDerived: public CDerived2, public CDerived3
{
public:
	void vfun() { }
	virtual void vgfun() { }

public:
	int m_gd;
};

class CGG: public CGDerived
{
public:
	int m_kc;
};


class CBase2
{

};

class CD2: virtual public CBase2
{

};

class CE: public CD2, public CDerived2
{

};

class CF: virtual public CBase2, virtual public CBase
{

};


#endif//TEST_CBASE_H</code></pre> 
   <br style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;">
   <br style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;">
   <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;"></p> 
   <div> 
    <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:12px;">版权声明：本文博客原创文章，博客，未经同意，不得转载。</p> 
    <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:12px;"><br></p> 
    <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:12px;"><br></p> 
    <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:12px;"><br></p> 
    <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:12px;"><br></p> 
    <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:12px;"><br></p> 
    <p style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:12px;"><br></p> 
    <p><font color="#333333"><span style="font-size:12px;">本文转自mfrbuaa博客园博客，原文链接：http://www.cnblogs.com/mfrbuaa/p/4675714.html，如需转载请自行联系原作者</span></font></p> 
    <div style="color:rgb(51,51,51);font-family:verdana, Arial, Helvetica, sans-serif;font-size:14px;">
     <br>
    </div> 
   </div> 
  </div> 
 </div> 
</div>
  </article>
  
  




</div>

        </div>
        <div class="col-second">
          <div class="col-box col-box-author">
  <img class="avatar" src="https://uzstatic-360cdn.belost.xyz/theme/default/images/logo.png" alt="柚子社区">
  <div class="col-box-title name">NotBeCN</div>
  <!-- <p>最新资讯</p> -->
  <p class="contact">
    
    <a href="mailto:fandyvon@163.com" target="_blank">邮箱</a>
    
    <a href="https://uzshare.com" target="_blank">柚子社区</a>
    
    <a href="https://uzzz.org" target="_blank">找组织</a>
    
  </p>
</div>

<div class="col-box">
  <div class="col-box-title">最新</div>
  <ul class="post-list">
    
      <li><a class="post-link" href="/2019/05/14/zxh1220_90138586.html">[原创软件] [软件发布] 定时备份文件发送邮箱，不再怕数据丢失了</a></li>
    
      <li><a class="post-link" href="/2019/05/14/weixin_45037290_90140056.html">Get智能写作满月记 ——产品篇</a></li>
    
      <li><a class="post-link" href="/2019/05/14/nulio__90138386.html">《深度探索C++对象模型》..............</a></li>
    
      <li><a class="post-link" href="/2019/05/13/qq_41248707_90140031.html">mysql 多表联查之连接查询</a></li>
    
      <li><a class="post-link" href="/2019/05/13/qq_21122683_90125902.html">golang基础(二)</a></li>
    
      <li><a class="post-link" href="/2019/05/13/1557726108256.html">今日份的PTA刷题</a></li>
    
      <li><a class="post-link" href="/2019/05/12/zzzfffei_90137366.html">Android之折线图</a></li>
    
      <li><a class="post-link" href="/2019/05/12/zzzfffei_90136638.html">Android之实现选中时改变样式</a></li>
    
  </ul>
</div>

<div class="col-box post-toc hide">
  <div class="col-box-title">目录</div>
</div>

<div class="col-box">
  <script async src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
  <!-- right_sidebar -->
  <ins class="adsbygoogle"
       style="display:block"
       data-ad-client="ca-pub-8889449066804352"
       data-ad-slot="2081363239"
       data-ad-format="auto"
       data-full-width-responsive="true"></ins>
  <script>
    (adsbygoogle = window.adsbygoogle || []).push({});
  </script>
</div>


        </div>
      </div>
    </div>

    <footer class="footer">
<div class="wrapper">
&copy; 2019 
</div>
</footer>

<script type="text/x-mathjax-config">MathJax.Hub.Config({tex2jax: {inlineMath: [['$','$']]}});</script>
<script src="/js/easybook.js"></script>

<!-- Global site tag (gtag.js) - Google Analytics -->
<script async src="https://www.googletagmanager.com/gtag/js?id=UA-123344652-5"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-123344652-5');
</script>


<script data-ad-client="ca-pub-8889449066804352" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>

<script>
var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.async = true;
  hm.src = "https://hm.baidu.com/hm.js?9b378145d7399199b371d067f4c8be96";
  var s = document.getElementsByTagName("script")[0]; 
  s.parentNode.insertBefore(hm, s);
})();
</script>




  </body>

</html>
